Show / Hide Table of Contents
Class ResultPoint
Point of results
Inheritance
System.Object
ResultPoint
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obsolete]
public class ResultPoint
Properties
Improve this Doc   View Source
Id
Id of Point
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Point
Location of Point
Declaration
public Point3D Point { get; set; }
Property Value
 Type |  Description
 Point3D
 Improve this Doc
 View Source